{"apples": "Worldwide, there are more than 7,500 known varieties, 100 of which are grown commercially in the US. They all differ in shape, size, color, texture, aroma and flavor.", "apricots": "Apricots only ripen on the tree. Once picked, they become softer but not more flavorful. Look for fruit that is bright with no green tinge.", "artichokes": "Look for a firm bulb with tightly closed bracts (petals). Discoloration on exterior bracts is usually a harmless symptom of frost damage.", "arugula": "Like most tender greens, arugula is perishable and needs to be used within a few days of purchase. Look for crisp leaves without mushiness.", "asian pears": "These rough-skinned fruits are crisp and juicy, and rounder in shape than other pears. Flavors range from barely sweet to tangy and sharp.", "asparagus": "Asparagus comes in green, white, purple and wild varities. Look for the thinnest stalks possible; these are the most tender. Steer clear of limp and wilted asparagus.", "avocados": "Its skin may be smooth or bumpy, bright green or black, and they can be pear-shaped, egg-shaped or spherical. An avocado is ripe when it yields to gentle pressure when squeezed.", "bananas": "Unless you intend to eat them right away, look for a bunch that is still slightly green and allow them to ripen on your counter. They should be firm, without bruised or black spots.", "basil": "For all varieties, choose fresh basil leaves that are rich in color. If pre-packaged, leaves should be vibrant and lacking dark spots or wilting, signs that the basil is less than fresh.", "beets": "Beet roots, stems and leaves are all edible. Beets should feel heavy for their size, with no mushy areas. If greens are attached, they should not be wilted or have yellow spots.", "black-eyed peas": "When it comes to fresh shell beans, look for pods that are plump and bumpy — you should be able to feel the fat seeds inside.", "blackberries": "Many brambles growers are not certified organic but do not spray their crops. Get as local as you can and ask the grower about their growing methods.", "blueberries": "Look for firm, dry, plump blueberries with smooth skin and no shriveled or moldy bits. Pass on greenish or red ones — they're underripe.", "bok choy": "Bok choy (or pok choi) stalks should be firm and blemish-free, with nothing bruised or mushy. Leaves should be perky and green, with no brown or yellow spots.", "boysenberries": "Boysenberries are a delicious reddish-purple bramble developed in the 1920s. They're a cross between the blackberry, raspberry and loganberry.", "brambles": "The word \"bramble\" is a catch-all term for several different fruits, including raspberries, blackberries, marionberries and many more varities.", "broccoli": "Broccoli florets should be tightly closed and deep green, with a purplish tinge; avoid limp or yellowing broccoli. Stems should be free of mold or signs of bruising.", "brussels sprouts": "Brussels sprouts are sold on and off the stalk. Look for compact heads with no sign of dulling or wilting. Sprouts should be bright green.", "burdock": "While it’s possible to eat the leaves and stems of the plant, the most commonly eaten part of burdock is the root. Its long, thin and starchy taproot is perfect for stir fries and soups.", "cabbage": "Red and green cabbage should have a firm, tight head and feel heavy for their size, with no black or soft spots. Savoy and Napa cabbage are generally a bit \"looser\".", "cantaloupe": "Look for a canteoupe with no nicks in the rind or mold on the blossom end. If it's perfectly ripe, the end should smell nice. Avoid melons with soft spots.", "cardoons": "Cardoons are sold in large bunches that look a lot like spiky, silvery celery. Stalks should be firm with no spongy or blackened spots.", "carrots": "Carrots come in all shades of purple, red, white, yellow and of course, orange. If they have the greens attached, look for feathery, perky leaves with no wilting, black spots or yellowing.", "cauliflower": "Look for an even color and a tightly packed head. Apart from its standard white, cauliflower also comes in purple, orange and green varieties.", "celery": "Pascal celery, the most readily found in the US, has tall, light green stalks that are thick and very crisp. It’s commonly sold with few leaves, but if you find it with the flavorful leaves intact, they can be used as an herb.", "celery root": "Also known as celeriac, this turnip-sized bulb grows underground. Look for a firm, apple-sized celery root with no soft or squishy spots.", "chard": "Also known as Swiss chard or rainbow chard, you can eat both the leaves and stems. You want crisp, perky and glossy leaves, with firm and healthy stems.", "cherries": "Cherries can be sweet (even the sour ones), delicious, and eaten raw or cooked. Look for cherries that are firm and have no bruises or browning.", "chestnuts": "Look for large, glossy nuts that feel heavy for their size and are free from cracks or chips. Ensure they haven’t dried out by shaking the nut — pass on any that rattle.", "chickpeas": "Also known as garbanzo beans, the fresh green pods (and seeds inside) are edible, but most are harvested dried. Chickpea leaves are also edible.", "chicories": "This includes radicchio, endive, frisee and escarole — bitter, leafy veggies that come in a rainbow of colors.", "chili peppers": "Chile peppers can range from tiny to relatively large and come in many colors, ranging from peach to bright red. They hould have glossy, firm skin with no brown or mushy spots.", "chives": "For both Chinese and European chives, you’re looking for pert green blades without signs of yellowing, moisture or mildew.", "cilantro": "Look for leaves that are dry and free of dark green goop. No yellowing or wilted leaves, which are signs of decay.", "citrus": "Select citrus that is of medium firmness. If the fruit is too hard or has green spots (except limes), it is not yet ripe. If it is too soft or bruised, it is past its prime.", "clementines": "A clementine is a hybrid between a mandarin orange and a sweet orange. They're sweet, juicy and less acidic than oranges; often referred to as seedless tangerines.", "collard greens": "Collards are a versatile and delicious member of the brassica family, and can be used both cooked and raw. Look for firm leaves and stems with no yellowing, spots or wilted leaves.", "corn": "Look for ears that are firm, plump and unblemished. Instead of stripping down the husks to examine, just gently squeeze cobs down the length of the ear to feel for bald spots.", "cranberries": "For the most flavorful cranberries, look for a deep, rich, bright color versus pale or translucent. Spoiled cranberries will be soft and won't bounce.", "cucumbers": "Since cucumbers are mostly water (about 96 percent water by weight), their cell walls break down quickly and turn into mush. Look for ones that are firm with no signs of discoloration.", "currants": "Currants can be found in black, red, white and pink varieties. Choose currants still attached to their string; shiny with no signs of mold or shriveling.", "dates": "Look for dates that have a nice shine and aren't overly dried. Skin should be a little translucent, with few rips and tears. Dates should be intact and separate, not mashed into a clump.", "edamame": "Edamame are soybeans harvested before maturing and drying in their pods. Fresh pods should be firm, plump and bright green.", "eggplant": "Eggplant are grown in a variety of shapes and sizes: green, white, purple, orange, globe-shaped, long and slender, and circular. Look for glossy, unblemished skin and a very firm texture when squeezed.", "endive": "Look for endive with tight heads that feel heavy for their size. All endive varieties should be free of black or mushy spots, with very few (to no) brown or wilting leaves.", "fava beans": "Look for bright green, firm, plump pods with minimal blemishes (although some spotting on the pods are fine). Avoid pods that are dried out, mushy or yellowing.", "fennel": "Fennel bulbs should be whitish-green, firm and heavy for their size, with no brown or mushy spots. If the feathery green fronds are still attached, they should have no signs of wilting or dryness.", "fiddleheads": "Look for fiddleheads that are tightly curled and no bigger than a half-dollar. Any brown, papery bits clinging to the veggie are just a part of the plant, most of which will be rinsed off when you clean them.", "figs": "Look for soft but not mushy fruit that is indicative of ripeness and flavor. Hard figs will not continue to ripen. If the figs have a sour smell, they are past their peak.", "garlic": "Mature garlic heads should have a paper-like skin that covers all the cloves, which ideally are firm and free of mold or bruises. Green garlic has a light green stalk and white bulb at the base with darker green tops.", "garlic scapes": "Scapes are the curled shoots of hardneck garlic varieties. Scapes should be firm but somewhat flexible and free of blemishes or moldy spots.", "ginger": "Ginger should have smooth skin, no dried-out or moldy looking areas and no mushiness.", "gooseberries": "Most gooseberries are grape-shaped and can be found in colors ranging from dark red to bright green. Look for firm, plump fruit avoiding mushy or mealy gooseberries.", "grapefruit": "Grapefruit should feel heavy in your hand and the skin should feel smooth. Avoid browning or squishy spots.", "grapes": "Look for fresh grapes with no brown spots, mold or large numbers of shriveled grapes on the cluster. Keep grapes as dry as possible in the refrigerator.", "green beans": "Fresh green beans should have a snappy crispness when bent in half. They should be free of blemishes and mold and the pod should not be hard or dried out.", "green onions": "Whether you call them green onions, spring onions or scallions, these alliums all offer a slightly milder taste than their onion cousins.", "ground cherries": "These sweet, tart yellow-orange fruits grow in a papery husk, and are often covered in a sticky substance that should be washed off. Leave the husks on until you’re ready to eat them.", "horseradish": "Horseradish is a large and tapering root with a dark brown peel and creamy interior. Look for firm roots with no mushy or black spots.", "jicama": "Jicamas resemble giant, round potatoes, with a crunchy texture similar to an apple, though less sweet. Look for smaller jicamas — any root bigger than 3-4 pounds is likely to be tough, fibrous and less sweet.", "kale": "When shopping for kale, stay clear of wilted or browning leaves. Leaves and stalks should be firm and dry instead of wilted and mushy.", "kiwi": "Look for kiwis that feel heavy for their size, with no mushy or discolored spots. A ripe kiwi will yield to gentle pressure when you squeeze it.", "kohlrabi": "Both the root and leafy greens of kohlrabi are edible. The bulb should be firm with no spongy bits and no visible brown spots.", "lamb's quarters": "This wild-foraged leafy green packs a nutritional punch with lots of protein, fiber, omega fatty acids and Vitamins A and C. Look for leaves that are perky.", "lavender": "Used for thousands of years as a medicine and perfume, this herb adds an delicious accent to sweet dishes. Dried lavender flowers should be vibrant in color and very aromatic.", "leeks": "Common leeks look like giant scallions and have a mild onion-y, sweet flavor. Look for leeks on the smaller side, 1-2\" in stem diameter with very dark greens that have no yellowing or wilted spots.", "lemongrass": "Lemongrass has a citrus flavor that’s similar to lemons, but with a more floral perfume and without the acidity. Look for stalks that are fairly supple, ideally with green leaves still attached.", "lemons": "Look for lemons that are bright and evenly colored. Lemons should be firm yet not rock hard and should feel heavy — a sign that it has a lot of juice.", "lettuce": "There are many varieties of lettuce, from loose-leaf to those bought as a head. For all varieties, look for leaves that are intact and not wilting.", "lima beans": "Lima beans are a type of shell bean and can be purchased either fresh in the pod or dried. If buying fresh, look for plump and bumpy pods.", "mandarins": "Color is not always a good indicator of a mandarin's ripeness, so don't hesitate to pick up one that is still a little green so long as it smells sweet.", "mangoes": "Since mangoes come in a variety of shades, color isn't always an indicator of ripeness. Instead, find one with leathery smooth skin and that smells fragrant.", "melons": "Avoid washing the melon exterior until you are ready to eat it as they are prone to mold. Once cut, store leftover melon in the refrigerator in an airtight container.", "mint": "Used both in cooking and herbal medicine, mint should have perky stems and leaves with no black spots or wilted parts. Fresh mint should also be very aromatic.", "morels": "Morels are a wild, cone-shaped mushroom with honeycomb-like texture. When purchasing, avoid morels that are discolored, splotchy or slimy.", "mushrooms": "There are several varieties of mushrooms and they can be purchased fresh or dried. Look for fresh mushrooms without slimy, moldy or black spots.", "mustard greens": "Mustard greens are  peppery, leafy greens in the same family as broccoli and kale. Look for perky greens that are not wilted with no mushy or black spots.", "nectarines": "A variety of peach with fuzzless skin, be sure to choose a fruit that has a strong perfume and is free of blemishes and bruises.", "nettles": "Nettles are an herb resembling an oversized mint leaf and are best bought or harvested when they are young and the stems are tender, before flower buds appear.", "nopales": "Nopales are the leaves of the prickly pear cactus. Harvesting young pads makes for a much easier time removing spines, although some vendors sell them with the spines already removed.", "okra": "Okra pods should be firm and springy with no mushy, brown or yellowing spots. Cooks agree that the perfect pod size is four to five inches long.", "olives": "Olives come in a variety of colors and may come whole or with the pit alread removed. Fresh, cured olives should be kept in the refrigerator to extend their life for a few weeks.", "onions": "When purchasing dried onions, avoid brown or mushy spots and choose onions that feel heavy for their size without any signs of sprouting.", "oranges": "Oranges that are still green and too hard are not yet ripe. Instead, choose an orange that has medium firmness and feels juicy when lightly squeezed.", "oregano": "Oregano and marjoram are both available as fresh or dried herbs. To preserve freshness, store dried herbs in a cool, dry place and store fresh herbs in the refrigerator.", "papaya": "A highly perishable fruit, look for papayas with skin that is slightly soft but not mushy or shriveled. To extend its freshness, refrigerate the fruit once ripened.", "parsley": "Parsley is available in both curly and flat-leaf varieties. For both, look for firm, perky leaves, firm stems and no wilting or yellowing of any kind.", "parsnips": "Parsnips are a root vegetable that look like a pale carrot, usually a shade of pale yellow or ivory. Look for parsnips that are firm but not tough.", "pea shoots": "Pea shoots are very young pea plants. They can be eaten like a green - braised, sauteed or tossed into salads - or made into pesto. Look for bright green pea shoots that are not wilted.", "peaches": "Conventionally grown peaches often contain high levels of pesticide residue, so it's wise to choose local varieties so you can understand how they were grown.", "peanuts": "Peanuts can often be purchased in their distinctive, textured shell either dry roasted or roasted in oil. Be sure to store peanuts in a cool, dry place and discard any peanuts that show signs of mold.", "pears": "An excellent source of both dietary fiber and Vitamin C, pears should be fragrant and soft when ripe. Unripe pears will ripen quickly in a paper bag at room temperature.", "peas": "Peas are a type of legume and come in a variety of sizes and colors including green, yellow and purple. Look for pods that are plump and bright green.", "pecans": "Pecans are oval-shaped nuts that have a rich, buttery flavor. They can range in color from tan to brown and can be purchased either in the shell or already shelled.", "peppers": "While there are several varieties of peppers, all should have very glossy, fim skin with no brown or mushy spots on the surface on the fruit.", "persimmons": "Red Hachiya persimmons are acorn-shaped and inedible unless fully ripe and very soft, while orange Fuyu persimmons are tomato-shaped and eaten firm.", "pineapple": "To check for ripeness, inspect the base of a pineapple and take a big whiff. Its perfume should be sweet, not fermented. Pass on any fruit that has moldy spots or leaves that are dried out.", "pistachios": "While pistachios can be eaten raw, most are sold already dried and roasted which helps with safe transport as they are prone to mold.", "plums": "When choosing a plum, look for firm, taught skin and fruit that has no bruises or blemishes. Unripe fruit can be ripened on the counter in a paper bag.", "pomegranates": "Leathery on the outside, pomegranates are filled with hundreds of edible plump, reddish seeds enclosed by an inedible cream-colored pulp. Choose fruits that feel heavy for their size.", "potatoes": "No matter the variety of potato, be sure to store them in a cool, dark place with low humidity where they can be stored at least one month and up to three months.", "pummelo": "The pummelo, the grapefruit's ancestor and the largest of all citrus fruits, has a spongy green pith and a sweet seedless pink or green interior.", "pumpkin": "While pumpkins come in a variety of types, sizes and colors - you should always choose a pumpkin that feels heavy for its weight and pass on those with any black or mushy spots.", "purslane": "Purslane has the most omega-3 fatty acids of any green vegetable. Its flavor is slightly tart and a bit lemony - perfect for summer salads.", "quince": "Quinces resemble a pear but are bumpy and round in the middle. It's common to find some nicks and bruises in its delicate skin but avoid fruit with dark brown or black mushy spots.", "radicchio": "Radicchio is a bitter leafy vegetable. Radicchio di Chioggia, the most common variety, resembles a small red cabbage, but radicchio comes in a variety of other shapes. In all cases, it should be crisp and unwilted.", "radishes": "Most radishes are sold with the tops attached: look for vibrant greens and firm roots. Don't forget you can saute the tops or use them in pesto!", "ramps": "Ramps are definitely delicious — a peppery and pungent cross between onion and garlic — and their ephemeral nature adds to their appeal. Make sure to select ramps without slimy or discolored patches.", "rapini": "Rapini, or broccoli rabe, looks like a leafier version of broccoli. Both the leaves and florets should be deep green without yellow spots.", "raspberries": "Good raspberries should be evenly colored and intact; squished berries will quickly go bad.", "rhubarb": "Rhubarb is a tart, spring-time vegetable with rosy, celery-like stalks. Look for thinner stalks with good color for the best taste and texture — thicker stalks may be more fibrous.", "rosemary": "With its pine-like flavor, rosemary pairs well with roasted vegetables and grilled meats. Look for strong-smelling bunches and avoid withered leaves.", "rutabaga": "The rutabaga is a sweet root vegetable that looks a lot like a large turnip with pale yellow flesh. Rutabagas are often sold with a protective layer of wax that improves shelf life, so peel them before cooking.", "sage": "With its distinctive smell, sage adds a savory note to many dishes. Look for sage that has perky, silvery green leaves and a strong smell, avoiding any withered or dry leaves.", "salsify": "Salsify is a slender woody root, with light brown or black skin and white flesh. White salsify is said to be similar to oysters in flavor.", "shallots": "With their delicate, sweet flavor, shallots look like small red onions. When buying shallots, make sure to feel under the papery husks to make sure the bulbs feel firm.", "shell beans": "Fresh shell beans cook much quicker than their dried out counterparts. Look for pods that have pronounced, evenly sized bumps and avoid those with noticeable empty spots.", "snap peas": "Snap peas are excellent raw or cooked. When shopping, look for those with full pods that are vibrant in color, avoiding any with mushy spots.", "snow peas": "Good snow peas will be bright green with thin, flexible pods. Snow peas are mildly flavored and can be served raw or cooked.", "sorrel": "Sorrel comes in both red and green varieties, but both resemble spinach. Sorrel has a sharp, tart, green apple taste that adds a tang to salads and cooked greens.", "spinach": "Fresh spinach leaves can be sold as loose leaves or still attached to the stem. Look for perky, evenly colored leaves with no mushy spots. Smaller leaves will be the most tender while larger leaves can be stringy in texture.", "sprouts": "Although you can sprout many seeds, the two most common sprouted types are bean and alfalfa. Look for sprouts that are perky and smell fresh. Avoid any that smell off or that appear slimy or wilted.", "strawberries": "Bigger isn't always better when it comes to strawberries: look for berries that are glossy, fragrant and deeply colored all the way up to the stem.", "summer squash": "Summer squash comes in many shapes and sizes, but smaller squash typically have a better texture and more concentrated flavor. Larger squash are better suited to baking and stuffing.", "sunchokes": "Sometimes called Jerusalem artichokes, sunchokes are the roots of a native North American plant in the sunflower family. Look for roots that are firm to the touch, with no spongy or mushy areas.", "sweet potatoes": "Nutritional powerhouses, sweet potatoes come in an array of shapes and colors. Look for sweet potatoes without dark blemishes or soft, discolored areas.", "tangerines": "Sweeter and easier to peel than oranges, tangerines are a staple of winter farmer's markets in warm areas. Some color irregularities and blemishes are normal in tangerines, but look for fruit that doesn't feel squishy or too soft.", "taro": "Taro is large root vegetable with brown skin and a creamy, purple-flecked interior. The tubers should be firm and feel heavy. Taro leaves are also sometimes found at the market: look for even color and avoid anything that looks wilted.", "tarragon": "Tarragon is an herb with a pungent, licorice-like flavor. Look for leaves that are perky and light green, avoiding any mushy or wilted bunches.", "thyme": "Fresh thyme imparts a bright, almost lemony flavor to soups, roasts and other dishes. When buying thyme, leaves should be fresh, green and firmly attached to the stems. Thyme with lots of wilted leaves is less fresh.", "tomatillos": "Herbal, tangy, citrusy and sweet, tomatillos are like no other fruit. Tomatillos should feel plump and unbroken under their papery husk.", "tomatoes": "Tomatoes come in a dizzying array of colors and shapes, so rather than relying on color alone, look for tomatoes that are heavy and fragrant. Some scarring is normal on heirloom varieties, but avoid tomatoes with freshly torn skin.", "turnips": "Sweeter and milder than their larger counterparts, baby turnips are perfect for eating raw, roasting or tossing in salads. Turnips should be firm with tight skin. Avoid any that look wrinkled or withered.", "watercress": "Watercress is a leafy green vegetable with a peppery flavor that pairs really well with duck and other game meats. Try to avoid any mushy leaves, as they can spoil the others in storage.", "watermelon": "When choosing a watermelon, look for darker green melons that feel heavy and sound hollow when tapped.", "winter squash": "Winter squash is actually harvested in autumn before a hard frost and stored for later. Squash comes in many sizes and colors and may even have decorative warts. Avoid squash with visibly broken skin.", "yams": "Although sweet potatoes are often called yams, true yams have rougher, bark-like skin and aren't as sweet. Yams should be very firm with no soft spots.", "zucchini": "Like other kinds of summer squash, smaller zucchini have a better flavor and texture for most cooking, while large zuchinni are best saved for baking or stuffing."}